{
  "architectures": [
    "DebertaV2ForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 1,
  "dtype": "float32",
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "OTP",
    "1": "\u05d0\u05d9\u05d5\u05dd",
    "2": "\u05d3\u05d7\u05d9\u05e4\u05d5\u05ea",
    "3": "\u05d4\u05e4\u05d7\u05d3\u05d4",
    "4": "\u05d4\u05ea\u05d7\u05d6\u05d5\u05ea",
    "5": "\u05e4\u05d9\u05e0\u05e0\u05e1\u05d9",
    "6": "\u05e4\u05d9\u05ea\u05d5\u05d9",
    "7": "\u05e4\u05e8\u05e1 \u05de\u05d6\u05d5\u05d9\u05e3",
    "8": "\u05ea\u05e7\u05d9\u05df"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "OTP": 0,
    "\u05d0\u05d9\u05d5\u05dd": 1,
    "\u05d3\u05d7\u05d9\u05e4\u05d5\u05ea": 2,
    "\u05d4\u05e4\u05d7\u05d3\u05d4": 3,
    "\u05d4\u05ea\u05d7\u05d6\u05d5\u05ea": 4,
    "\u05e4\u05d9\u05e0\u05e0\u05e1\u05d9": 5,
    "\u05e4\u05d9\u05ea\u05d5\u05d9": 6,
    "\u05e4\u05e8\u05e1 \u05de\u05d6\u05d5\u05d9\u05e3": 7,
    "\u05ea\u05e7\u05d9\u05df": 8
  },
  "layer_norm_eps": 1e-07,
  "legacy": true,
  "max_position_embeddings": 512,
  "max_relative_positions": -1,
  "model_type": "deberta-v2",
  "norm_rel_ebd": "layer_norm",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_dropout": 0,
  "pooler_hidden_act": "gelu",
  "pooler_hidden_size": 768,
  "pos_att_type": [
    "p2c",
    "c2p"
  ],
  "position_biased_input": false,
  "position_buckets": 256,
  "relative_attention": true,
  "share_att_key": true,
  "transformers_version": "4.57.3",
  "type_vocab_size": 0,
  "vocab_size": 251000
}
